app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "5"]]
---
  def show
    id = params[:id]
    @movie = Movie.find(id)

INSERT INTO "movies" ("created_at", "description", "rating", "release_date", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sat, 01 Sep 2012 23:22:43 UTC +00:00], ["description", nil], ["rating", nil], ["release_date", nil], ["title", nil], ["updated_at", Sat, 01 Sep 2012 23:22:43 UTC +00:00]]
---
  def create

    # preparation
    #release_date = DateTime.new( params[:movie]["release_date(1i)"].to_i,
    #                             params[:movie]["release_date(2i)"].to_i,
    #                             params[:movie]["release_date(3i)"].to_i )

    # create an active record object
    #@movie = Movie.new
    #@movie.title = params[:movie][:title]
    #@movie.rating = params[:movie][:rating]
    #@movie.release_date = release_date
    #@movie.save

    @movie = Movie.new(params[:movie])
    @movie.save